sim/analysis/static/10000_1600_1/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// swak4Foam libraries
libs (
      "libOpenFOAM.so"
      "libsimpleSwakFunctionObjects.so"
      "libswakFunctionObjects.so"
      "libgroovyBC.so"
     );

application     rhoReactingCentralFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

//endTime       2.5e-4;	// full run  
endTime		3e-5;	// quick test

deltaT          1e-9;

writeControl    adjustableRunTime;

//writeInterval   2.5e-5;
writeInterval	1e-6;
//writeInterval	1e-5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

useAcousticCourant yes;

maxCo           0.1;
maxDeltaT		1e-6;
maxAcousticCo	0.1;

functions
{
	#includeFunc residuals
}

// ************************************************************************* //
